{
    "title": "How I Make Learning New Things Feel Easy and Avoid Burnout",
    "authorName": "Lakshya Singh",
    "authorImage": "../first-blog/img/blog-image-1.jpg",
    "publishDate": "January 18, 2025",
    "content": "<img src='../sec-blog/img/blog1.webp' alt='Ricardo matos'><p>You’ve probably heard the saying, it takes 10,000 hours to master a new skill.</p></br><p>The idea came from Malcolm Gladwell’s book, Outliers. But the idea was based on a misconception.</br></br>In 2014 a Professor of Psychology at Florida State University wrote an essay called ‘The Danger of Delegating Education to Journalists’, debunking what Gladwell and others had written about his research. </br></br>Anders K. Ericsson led a study on expert violinists and found that 10,000 hours of practice was the average practice length of the best group. However, the study was done on multiple groups of expert musicians and many had accumulated far less practice time.</br></br> In conclusion, <b>there is no magic number of hours.</b> There are more variables at play.</br></br> Engineers. Developers. Analysts. Students. These roles require skills in many complicated topics. If you’re reading this, then like me, you probably fall into one of those categories. But it can feel overwhelming with so many things to learn and little time to spare.</br></br> Conveniently, learning a complicated skill requires less time than you think. </br></br>Coding in Python was one of the first skills I learned to become a cloud engineer. I would spend 30–60 minutes each day practicing. At first, I found it difficult to remain consistent and whenever I missed a few days of study, I struggled to get back into the routine.</br></br> But after a few weeks of consistent practice, I quickly began to connect the dots.</br></p></br><h2>Josh Kaufman, a famous business researcher said this:</h2></br><pre>“The first few hours of learning a particular skill is validated</br>by research to be, both the most effective and the most efficient.</br></br><b>You can go from knowing absolutely nothing about something to </br>being reasonably good in much less time than you’ll expect.</b></br></br>[From my research] it’s about 20 hours of deliberate practice.”</pre></br><p>Imagine. You can start practicing a skill you know nothing about, and after 20 hours, you will be good at it. You won’t immediately be an expert, but you’ll be good.</br></br>Notice he used the word ‘deliberate’. It was the same word used by Ericsson in his research paper.</br></br>This means you must be actively involved in whatever you are learning. Watching 20 hours of YouTube tutorials won’t do.</br></br><b>Here’s how to learn a new skill in 20 hours according to Kaufman:</b></br></br></p><h3>1. Make studying a daily habit</h3><p>20 hours is only 40 minutes a day for a month.</br></br>You don’t have to spend all your mornings, evenings, and weekends in front of your desk, missing out on precious time with family and friends.</br></br>Doing this will only lead to burnout. I used to study this way when at university, but it would take me just as long to recover.</br></br>Pick a specific time of day and protect that time ruthlessly. Don’t let anything else distract you for that set amount of time. For example, I wake up early and try not to sleep too late. Then I can use the spare hours to study. As a cloud engineer, I also get a fixed amount of time for personal development. I time-block this in my calendar for the same time every week.</br></br></p><h3>2. Start small and specific</h3><p>When we try to learn something new, we often bite off more than we can chew. Start with something specific, concrete, and approachable.</br></br>For example, wanting to understand machine learning as a complete beginner might feel overwhelming because of the broad range of math, concepts, and coding involved.</br></br>To start small, focus on understanding the differences between artificial intelligence, machine learning, and deep learning. Then you might learn high-level concepts like data, model training, and evaluation.</br></br>The idea is to take small bites so you don’t stress or confuse yourself early on.</p></br></p><h3>3. Deconstruct the skill</h3><p>A skill is usually a bundle of smaller skills we combine to make up that skill.</br></br>For instance, a cloud engineer should understand how to deploy infrastructure through code. This skill requires subskills like understanding terminal commands and cloud platforms like AWS.</br></br>Start by understanding it then break down the skill into smaller core components. What should you focus on now and what can wait until later?</br></br>Give your attention to what will yield the greatest results first.</p></br></p><h3>4. Learn enough to self-correct</h3><p>Being able to correct your own mistakes requires understanding what good and bad look like.</br></br>This requires research. But you don’t want to spend too much time in this stage because you might start procrastinating. Only do enough research to gain enough context to understand right from wrong so you can self-correct.</br></br>If you wanted to play a song on the guitar, you would learn the chords to that song and read from a music sheet. If you play the wrong chord, you will realize something doesn’t sound right then try to correct yourself.</br></br>We can apply the same logic to anything we want to learn.</p></br></p><h3>5. Remove distractions</h3><p>Last but not least you want to remove all distractions.</br></br>If you dedicate 40 minutes a day to studying, but the first 10 minutes of that is spent on your phone scrolling your social media feed, reaching your goal will take longer. It will feel much harder and you will fall short of your target.</br></br>The best way to avoid this scenario is to remove yourself from an environment with distractions. Consider going to a library or some other quiet environment. Put your phone on do-not-disturb for 40 minutes or lock your apps to add friction when accessing them.</br></br>Do anything you can within reason to help yourself stay focused.</p></br></br><h3>Takeaways</h3><p>You don’t need thousands or even hundreds of hours to get good at a new skill. 40 minutes of deliberate, daily practice for a few weeks is enough.</br></br>Start small. Learn the fundamentals and gradually explore more complex topics as you go. Reverse engineer the skill by breaking it into smaller components and seeing how the pieces connect.</br></br>Learn just enough theory to correct your own mistakes. But don’t get stuck in an endless cycle of watching rather than doing.</br></br>Do all of this somewhere with as few distractions as possible.</p></br><p><i>Thanks for reading.</i></p>"
}